feat: update api docs README.md
